#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.dynamic_subnets.module.utils.data.aws_regions.not_opted_in: Reading...
module.dynamic_subnets.module.utils.data.aws_regions.complete: Reading...
module.dynamic_subnets.module.utils.data.aws_regions.default: Reading...
module.dynamic_subnets.data.aws_availability_zones.default[0]: Reading...
module.dynamic_subnets.module.utils.data.aws_regions.opted_in: Reading...
module.dynamic_subnets.module.utils.data.aws_regions.default: Read complete after 1s [id=aws]
module.dynamic_subnets.module.utils.data.aws_regions.not_opted_in: Read complete after 1s [id=aws]
module.dynamic_subnets.module.utils.data.aws_regions.complete: Read complete after 1s [id=aws]
module.dynamic_subnets.data.aws_availability_zones.default[0]: Read complete after 1s [id=eu-west-2]
module.dynamic_subnets.module.utils.data.aws_regions.opted_in: Read complete after 1s [id=aws]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.dynamic_subnets.data.aws_vpc.default[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_vpc" "default" {
      + arn                                  = (known after apply)
      + cidr_block                           = (known after apply)
      + cidr_block_associations              = (known after apply)
      + default                              = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = (known after apply)
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + state                                = (known after apply)
      + tags                                 = (known after apply)
    }

  # module.dynamic_subnets.aws_network_acl.private[0] will be created
  + resource "aws_network_acl" "private" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Attributes" = "private"
          + "Name"       = "envoy-associates-prod-smb-private"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + tags_all   = {
          + "Attributes" = "private"
          + "Name"       = "envoy-associates-prod-smb-private"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + vpc_id     = (known after apply)
    }

  # module.dynamic_subnets.aws_network_acl.public[0] will be created
  + resource "aws_network_acl" "public" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Attributes" = "public"
          + "Name"       = "envoy-associates-prod-smb-public"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + tags_all   = {
          + "Attributes" = "public"
          + "Name"       = "envoy-associates-prod-smb-public"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + vpc_id     = (known after apply)
    }

  # module.dynamic_subnets.aws_network_acl_rule.private4_egress[0] will be created
  + resource "aws_network_acl_rule" "private4_egress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.dynamic_subnets.aws_network_acl_rule.private4_ingress[0] will be created
  + resource "aws_network_acl_rule" "private4_ingress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.dynamic_subnets.aws_network_acl_rule.public4_egress[0] will be created
  + resource "aws_network_acl_rule" "public4_egress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.dynamic_subnets.aws_network_acl_rule.public4_ingress[0] will be created
  + resource "aws_network_acl_rule" "public4_ingress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.dynamic_subnets.aws_route.public[0] will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {}
    }

  # module.dynamic_subnets.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes" = "private"
          + "Name"       = "envoy-associates-prod-smb-private-euw2a"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + tags_all         = {
          + "Attributes" = "private"
          + "Name"       = "envoy-associates-prod-smb-private-euw2a"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + vpc_id           = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes" = "private"
          + "Name"       = "envoy-associates-prod-smb-private-euw2b"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + tags_all         = {
          + "Attributes" = "private"
          + "Name"       = "envoy-associates-prod-smb-private-euw2b"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + vpc_id           = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes" = "private"
          + "Name"       = "envoy-associates-prod-smb-private-euw2c"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + tags_all         = {
          + "Attributes" = "private"
          + "Name"       = "envoy-associates-prod-smb-private-euw2c"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + vpc_id           = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes" = "public"
          + "Name"       = "envoy-associates-prod-smb-public"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + tags_all         = {
          + "Attributes" = "public"
          + "Name"       = "envoy-associates-prod-smb-public"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + vpc_id           = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dynamic_subnets.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = (known after apply)
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Attributes" = "private"
          + "Name"       = "envoy-associates-prod-smb-private-euw2a"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + tags_all                                       = {
          + "Attributes" = "private"
          + "Name"       = "envoy-associates-prod-smb-private-euw2a"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {}
    }

  # module.dynamic_subnets.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = (known after apply)
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Attributes" = "private"
          + "Name"       = "envoy-associates-prod-smb-private-euw2b"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + tags_all                                       = {
          + "Attributes" = "private"
          + "Name"       = "envoy-associates-prod-smb-private-euw2b"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {}
    }

  # module.dynamic_subnets.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = (known after apply)
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Attributes" = "private"
          + "Name"       = "envoy-associates-prod-smb-private-euw2c"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + tags_all                                       = {
          + "Attributes" = "private"
          + "Name"       = "envoy-associates-prod-smb-private-euw2c"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {}
    }

  # module.dynamic_subnets.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = (known after apply)
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Attributes" = "public"
          + "Name"       = "envoy-associates-prod-smb-public-euw2a"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + tags_all                                       = {
          + "Attributes" = "public"
          + "Name"       = "envoy-associates-prod-smb-public-euw2a"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {}
    }

  # module.dynamic_subnets.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = (known after apply)
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Attributes" = "public"
          + "Name"       = "envoy-associates-prod-smb-public-euw2b"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + tags_all                                       = {
          + "Attributes" = "public"
          + "Name"       = "envoy-associates-prod-smb-public-euw2b"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {}
    }

  # module.dynamic_subnets.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = (known after apply)
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Attributes" = "public"
          + "Name"       = "envoy-associates-prod-smb-public-euw2c"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + tags_all                                       = {
          + "Attributes" = "public"
          + "Name"       = "envoy-associates-prod-smb-public-euw2c"
          + "Namespace"  = "envoy-associates"
          + "Stage"      = "prod"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {}
    }

  # module.vpc.aws_default_security_group.default[0] will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "envoy-associates-prod-smb-default"
          + "Namespace" = "envoy-associates"
          + "Stage"     = "prod"
        }
      + tags_all               = {
          + "Name"      = "envoy-associates-prod-smb-default"
          + "Namespace" = "envoy-associates"
          + "Stage"     = "prod"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.default[0] will be created
  + resource "aws_internet_gateway" "default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"      = "envoy-associates-prod-smb"
          + "Namespace" = "envoy-associates"
          + "Stage"     = "prod"
        }
      + tags_all = {
          + "Name"      = "envoy-associates-prod-smb"
          + "Namespace" = "envoy-associates"
          + "Stage"     = "prod"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_vpc.default[0] will be created
  + resource "aws_vpc" "default" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.1.0.0/24"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = false
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"      = "envoy-associates-prod-smb"
          + "Namespace" = "envoy-associates"
          + "Stage"     = "prod"
        }
      + tags_all                             = {
          + "Name"      = "envoy-associates-prod-smb"
          + "Namespace" = "envoy-associates"
          + "Stage"     = "prod"
        }
    }

Plan: 26 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @gerrardrose, Action: `pull_request`*